Мюнцкабинент_30/src/InformationRegisters/ПочтовыеИдентификаторы/ПочтовыеИдентификаторы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПочтовыеИдентификаторы</name>
  <comment>Почтовые идентификаторы для отслеживания отправлений</comment>
  <resources>
    <name>ТипИдентификатора</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыПочтовыхИдентификаторов</types>
    </type>
  </resources>
  <resources>
    <name>ПочтовыйИдентификатор</name>
    <type>
      <types>Characteristic.ВидыПочтовыхИдентификаторов</types>
    </type>
  </resources>
  <attributes>
    <name>ВрученАдресату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийСтатус</name>
    <type>
      <types>CatalogRef.ПочтовыеСтатусы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущийСтатус</name>
    <comment>Для контроля изменения статуса</comment>
    <type>
      <types>CatalogRef.ПочтовыеСтатусы</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DefinedType.ОтслеживаемыеПочтовыеОтправления</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Мюнцкабинент_30/src/InformationRegisters/ПочтовыеИдентификаторы/ManagerModule.bsl
Функция ПолучитьПочтовыйИдентификатор (ДокСсылка) Экспорт
	
	ПочтовыйИдентификатор = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПочтовыеИдентификаторы.ПочтовыйИдентификатор
		|ИЗ
		|	РегистрСведений.ПочтовыеИдентификаторы КАК ПочтовыеИдентификаторы
		|ГДЕ
		|	ПочтовыеИдентификаторы.Документ = &ДокСсылка";
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ПочтовыйИдентификатор = ВыборкаДетальныеЗаписи.ПочтовыйИдентификатор
	КонецЕсли;
	
	Возврат ПочтовыйИдентификатор
	
КонецФункции	

Функция ПолучитьИнформациюОПочтовомОтправлении (ДокСсылка) Экспорт
	
	ИнформацияОПочтовомОтправлении = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПочтовыеИдентификаторы.ПочтовыйИдентификатор,
		|	ПочтовыеИдентификаторы.ВрученАдресату,
		|	ПочтовыеИдентификаторы.СтранаПолучателя,
		|	ПочтовыеИдентификаторы.ИндексПолучателя,
		|	ПочтовыеИдентификаторы.АдресПолучателя,
		|	ПочтовыеИдентификаторы.Вес,
		|	ПочтовыеИдентификаторы.Категория,
		|	ПочтовыеИдентификаторы.Наименование
		|ИЗ
		|	РегистрСведений.ПочтовыеИдентификаторы КАК ПочтовыеИдентификаторы
		|ГДЕ
		|	ПочтовыеИдентификаторы.Документ = &ДокСсылка";
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ИнформацияОПочтовомОтправлении = Новый Структура;
		//
		ИнформацияОПочтовомОтправлении.Вставить("ПочтовыйИдентификатор", 	ВыборкаДетальныеЗаписи.ПочтовыйИдентификатор);
		ИнформацияОПочтовомОтправлении.Вставить("ВрученАдресату", 			ВыборкаДетальныеЗаписи.ВрученАдресату);
		ИнформацияОПочтовомОтправлении.Вставить("СтранаПолучателя", 		ВыборкаДетальныеЗаписи.СтранаПолучателя);
		ИнформацияОПочтовомОтправлении.Вставить("ИндексПолучателя", 		ВыборкаДетальныеЗаписи.ИндексПолучателя);
		ИнформацияОПочтовомОтправлении.Вставить("АдресПолучателя", 			ВыборкаДетальныеЗаписи.АдресПолучателя);
		ИнформацияОПочтовомОтправлении.Вставить("Вес", 						ВыборкаДетальныеЗаписи.Вес);
		ИнформацияОПочтовомОтправлении.Вставить("Категория", 				ВыборкаДетальныеЗаписи.Категория);
		ИнформацияОПочтовомОтправлении.Вставить("Наименование", 			ВыборкаДетальныеЗаписи.Наименование);
	КонецЕсли;
	
	Возврат ИнформацияОПочтовомОтправлении
	
КонецФункции	

Функция ПолучитьДокументПоИдентификатору (ПочтовыйИдентификатор) Экспорт
	
	ДокументСсылка = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПочтовыеИдентификаторы.Документ
		|ИЗ
		|	РегистрСведений.ПочтовыеИдентификаторы КАК ПочтовыеИдентификаторы
		|ГДЕ
		|	ПочтовыеИдентификаторы.ПочтовыйИдентификатор = &ПочтовыйИдентификатор";
	
	Запрос.УстановитьПараметр("ПочтовыйИдентификатор", СокрЛП(ПочтовыйИдентификатор));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ДокументСсылка = ВыборкаДетальныеЗаписи.Документ;
	КонецЕсли;
	
	 Возврат ДокументСсылка
	
 КонецФункции	
 
Процедура ЗаписатьПараметрыПочтовогоОтправления (Параметры) Экспорт
	Если НЕ Параметры.Свойство ("ПочтовыйИдентификатор") Тогда
		Возврат
	КонецЕсли;	
	//
	ДокСсылка = ПолучитьДокументПоИдентификатору (Параметры.ПочтовыйИдентификатор);
	
	НЗ = РегистрыСведений.ПочтовыеИдентификаторы.СоздатьНаборЗаписей();
	НЗ.Отбор.Документ.Установить (ДокСсылка);
	НЗ.Прочитать ();
	
	Если Параметры.Свойство ("СтранаПолучателя") И ЗначениеЗаполнено(Параметры.СтранаПолучателя) Тогда
		НЗ [0].СтранаПолучателя = Параметры.СтранаПолучателя	
	КонецЕсли;	
	
	Если Параметры.Свойство ("ИндексПолучателя") И ЗначениеЗаполнено(Параметры.ИндексПолучателя) Тогда
		НЗ [0].ИндексПолучателя = Параметры.ИндексПолучателя	
	КонецЕсли;	
	
	Если Параметры.Свойство ("АдресПолучателя") И ЗначениеЗаполнено(Параметры.АдресПолучателя) Тогда
		НЗ [0].АдресПолучателя = Параметры.АдресПолучателя	
	КонецЕсли;	
	
	Если Параметры.Свойство ("Вес") И ЗначениеЗаполнено(Параметры.Вес) Тогда
		НЗ [0].Вес = Число(Параметры.Вес)	
	КонецЕсли;	
	
	Если Параметры.Свойство ("Категория") И ЗначениеЗаполнено(Параметры.Категория) Тогда
		НЗ [0].Категория = Параметры.Категория	
	КонецЕсли;	
	
	Если Параметры.Свойство ("Наименование") И ЗначениеЗаполнено(Параметры.Наименование) Тогда
		НЗ [0].Наименование = Параметры.Наименование
	ИначеЕсли Параметры.Свойство ("Категория") И ЗначениеЗаполнено(Параметры.Категория) Тогда
		НЗ [0].Наименование = Параметры.Категория
	КонецЕсли;	
	
	Если Параметры.Свойство ("Отправитель") И ЗначениеЗаполнено(Параметры.Отправитель) Тогда
		НЗ [0].Отправитель = Параметры.Отправитель	
	КонецЕсли;	
	
	Если Параметры.Свойство ("Получатель") И ЗначениеЗаполнено(Параметры.Получатель) Тогда
		НЗ [0].Получатель = Параметры.Получатель	
	КонецЕсли;	
	
	НЗ.Записать();
	
	
КонецПроцедуры	 

Процедура УстановитьОтметкуОВручении (ДокСсылка) Экспорт
	
	НЗ = РегистрыСведений.ПочтовыеИдентификаторы.СоздатьНаборЗаписей();
	НЗ.Отбор.Документ.Установить (ДокСсылка);
	НЗ.Прочитать ();
	
	НЗ [0].ВрученАдресату = Истина;
	
	НЗ.Записать();
	
КонецПроцедуры	

Процедура УстановитьТекущийСтатус (ДокСсылка, Статус) Экспорт
	
	Если Статус = Неопределено ИЛИ Статус = Справочники.ПочтовыеСтатусы.ПустаяСсылка() Тогда
		Возврат
	КонецЕсли;	
	
	НЗ = РегистрыСведений.ПочтовыеИдентификаторы.СоздатьНаборЗаписей();
	НЗ.Отбор.Документ.Установить (ДокСсылка);
	НЗ.Прочитать ();
	
	НЗ [0].ПредыдущийСтатус = НЗ [0].ТекущийСтатус;
	НЗ [0].ТекущийСтатус 	= Статус;
	
		
	НЗ.Записать();	
		
		
	//РаботаСПочтовымиОтправлениями.ОповеститьОбИзмененииСтатуса(ДокСсылка, Статус, НЗ [0].ПочтовыйИдентификатор); 
	
	
	
КонецПроцедуры
